app/views/questions/show.html.erb

<p>Question: <%= @question.description %></p>
<% @question.answers.each do |answer| %>
---
SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = ?  [["question_id", 1]]