app/views/departments/show.html.erb

  <div>
    <% @department.categories.each do |category| %>
---
SELECT "categories".* FROM "categories" WHERE "categories"."department_id" = ?  [["department_id", 2]]