app/views/orders/show.html.erb

<ul>
    <% @order.lineitems.each do |item| %>
---
SELECT "lineitems".* FROM "lineitems" WHERE "lineitems"."order_id" = ?  [["order_id", 10]]