app/helpers/answers_helper.rb

SELECT "users".* FROM "users"
---
    def user_id_field(answer)
        if answer.user.nil?
            select_tag "answer[user_id]", options_from_collection_for_select(User.all, :id, :username)

SELECT "questions".* FROM "questions"
---
    def question_id_field(answer)
        if answer.question.nil?
            select_tag "answer[question_id]", options_from_collection_for_select(Question.all, :id, :name)