app/helpers/categories_helper.rb

    def department_id_field(category)
        if category.department.nil?
            select_tag "category[department_id]", options_from_collection_for_select(Department.all, :id, :name)
---
SELECT "departments".* FROM "departments"