app/helpers/questions_helper.rb

SELECT "users".* FROM "users"
---
    def question_customer_id_field(question)
        if question.customer.nil?
            select_tag "question[customer_id]", options_from_collection_for_select(User.all, :id, :username)

SELECT "products".* FROM "products"
---
    def question_product_id_field(question)
        if question.product.nil?
            select_tag "question[product_id]", options_from_collection_for_select(Product.all, :id, :name)