app/helpers/reviews_helper.rb

SELECT "users".* FROM "users"
---
    def review_customer_id_field(review)
        if review.customer.nil?
            select_tag "review[customer_id]", options_from_collection_for_select(User.all, :id, :username)

SELECT "products".* FROM "products"
---
    def review_product_id_field(review)
        if review.product.nil?
            select_tag "review[product_id]", options_from_collection_for_select(Product.all, :id, :name)