app/views/tags/show.html.erb

SELECT "categories".* FROM "categories" INNER JOIN "taggings" ON "categories"."id" = "taggings"."category_id" WHERE "taggings"."tag_id" = ?  [["tag_id", 2]]
---
  <div>
<% @tag.categories.each do |category| %>