app/controllers/answers_controller.rb

    def index
        if params[:user_id]
            @user = User.find(params[:user_id])
            @answers = User.find(params[:user_id]).answers
            @questions = Question.all
        else
            @answers = Answer.all
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "answers".* FROM "answers" WHERE "answers"."user_id" = ?  [["user_id", 1]]
SELECT "questions".* FROM "questions"
SELECT "answers".* FROM "answers"

    def show
        @answer = Answer.find(params[:id])
        @question = Question.find(params[:id])
---
SELECT  "answers".* FROM "answers" WHERE "answers"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

    def new
        if params[:user_id] && !User.exists?(params[:user_id])
---
SELECT "users".* FROM "users"

    def create
        @answer = Answer.new(answer_params)
        @answer.save
---
INSERT INTO "answers" ("name", "description", "user_id", "question_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "test"], ["description", "test"], ["user_id", 73661865], ["question_id", 4], ["created_at", "2021-10-23 06:13:28.650477"], ["updated_at", "2021-10-23 06:13:28.650477"]]