app/controllers/application_controller.rb

SELECT  "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT  "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2021-10-21 08:08:07.466161"], ["updated_at", "2021-10-21 08:08:07.466161"]]
---
    def current_cart
      if session[:cart_id]
        cart = Cart.find_by(:id => session[:cart_id])
        if cart.present?
          @current_cart = cart
        else
          session[:cart_id] = nil
        end
      end

      if session[:cart_id] == nil
        @current_cart = Cart.create