app/controllers/categories_controller.rb

    def index
        if params[:user_id]
            @user = User.find(params[:user_id])
            @categories = User.find(params[:user_id]).categories
            if params[:tag]
                @categories = Category.tagged_wth(params[:tag])
            end
        elsif params[:tag]
            @categories = Category.tagged_with(params[:tag])
        else
            @categories = Category.all
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "categories".* FROM "categories"
SELECT "tags".* FROM "tags" WHERE "tags"."id" = ?  [["id", 1]]

    def create
        @category = Category.new(category_params)
        @category.save
---
INSERT INTO "categories" ("name", "created_at", "updated_at", "department_id") VALUES (?, ?, ?, ?)  [["name", "Poo"], ["created_at", "2021-10-23 05:39:38.599284"], ["updated_at", "2021-10-23 05:39:38.599284"], ["department_id", 2]]