app/controllers/departments_controller.rb

    def show
        @department = Department.find(params[:id])
---
SELECT  "departments".* FROM "departments" WHERE "departments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create
        @department = Department.new(department_params)
        @department.save
---
INSERT INTO "departments" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Test"], ["created_at", "2021-10-20 04:42:32.390357"], ["updated_at", "2021-10-20 04:42:32.390357"]]

    def edit
        @department = Department.find(params[:id])
---
SELECT  "departments".* FROM "departments" WHERE "departments"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

    def update
        @department = Department.find(params[:id])
---
SELECT  "departments".* FROM "departments" WHERE "departments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]