app/controllers/orders_controller.rb

    def index
        if params[:user_id]
            @user = User.find(params[:user_id])
            @orders = Order.where(customer_id: current_user)
        else
            @orders = Order.all
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 73661865], ["LIMIT", 1]]
SELECT "orders".* FROM "orders" WHERE "orders"."customer_id" = ?  [["customer_id", 73661865]]
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create
        @order = Order.new(order_params)
        @current_cart.lineitems.each do |item|
          @order.lineitems << item
          item.cart_id = nil
        end

        @order.email = current_user.email
        @order.total = @order.sub_total
        @order.customer_id = current_user.id
        active_merchant_biller
        @order.save
        Cart.destroy(session[:cart_id])
---
SELECT "lineitems".* FROM "lineitems" WHERE "lineitems"."cart_id" = ?  [["cart_id", 2]]
INSERT INTO "orders" ("bill_firstname", "bill_lastname", "bill_address1", "bill_address2", "bill_city", "bill_state", "bill_zipcode", "ship_firstname", "ship_lastname", "ship_address1", "ship_address2", "ship_city", "ship_state", "ship_zipcode", "phone", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "orders" ("email", "card_number", "card_expiration_date", "card_verification", "bill_firstname", "bill_lastname", "bill_address1", "bill_address2", "bill_city", "bill_state", "bill_zipcode", "ship_firstname", "ship_lastname", "ship_address1", "ship_address2", "ship_city", "ship_state", "ship_zipcode", "phone", "total", "customer_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 6]]