app/controllers/products_controller.rb

    def index
        @search = params[:search]
        if params[:user_id]
            @user = User.find(params[:user_id])
            if @search.present?
                @name = @search[:name]
                @products = User.find(params[:user_id]).products.where(name: @name)
            elsif params[:tag]
                if @search.present?
                    @name = @search[:name]
                    @products = Product.tagged_with(params[:tag]).where(name: @name)
                else
                    @products = Product.tagged_with(params[:tag])
                end
            else
                @products = User.find(params[:user_id]).products
            end
        elsif params[:tag]
            if @search.present?
                @name = @search[:name]
                @products = Product.tagged_with(params[:tag]).where(name: @name)
            end
        else
            if @search.present?
                @name = @search[:name]
                @products = Product.where(name: @name)
            else
                @products = Product.all
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "products".* FROM "products" WHERE "products"."name" = ?  [["name", "test"]]
SELECT  "tags".* FROM "tags" WHERE "tags"."name" = ? LIMIT ?  [["name", "Test"], ["LIMIT", 1]]
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 73661865], ["LIMIT", 1]]
SELECT "products".* FROM "products"
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "tags".* FROM "tags" WHERE "tags"."id" = ?  [["id", 1]]

    def show
        @user = User.find(params[:user_id]) if params[:user_id]
        @product = Product.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

    def new
        if params[:seller_id] && !User.exists?(params[:seller_id])
---
SELECT "users".* FROM "users"

    def create
        @product = Product.new(product_params)
        @product.save
---
INSERT INTO "products" ("name", "price", "description", "seller_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "test"], ["price", 0.0], ["description", "test"], ["seller_id", 73661865], ["created_at", "2021-10-23 05:09:57.267214"], ["updated_at", "2021-10-23 05:09:57.267214"]]

    def edit
        if params[:seller_id]
            seller = User.find_by(id: params[:seller_id])
            if seller.nil?
                redirect_to users_path, alert: "Seller not found."
            else
                @product = seller.products.find_by(id: params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 73661865], ["LIMIT", 1]]
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def update
        @product = Product.find(params[:id])
        @product.update(product_params)
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "products" SET "name" = ?, "description" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["name", "#1 Most Amazing Product EVAAAA"], ["description", "It's the product of of your dreams!"], ["updated_at", "2021-10-17 06:58:27.865710"], ["id", 1]]