app/controllers/questions_controller.rb

    def index
        if params[:user_id]
            @user = User.find(params[:user_id])
            @questions = User.find(params[:user_id]).questions
        else
            @questions = Question.all
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "questions".* FROM "questions"

    def new
        if params[:customer_id] && !User.exists?(params[:customer_id])
---
SELECT "users".* FROM "users"

    def create
        @question = Question.new(question_params)
        @question.save
---
INSERT INTO "questions" ("name", "description", "customer_id", "product_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Hello?"], ["description", "Is this working?"], ["customer_id", 3], ["product_id", 1], ["created_at", "2021-10-20 02:38:26.108379"], ["updated_at", "2021-10-20 02:38:26.108379"]]