app/controllers/reviews_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 73661865], ["LIMIT", 1]]
---
    def index
        if params[:user_id]
            @user = User.find(params[:user_id])
            @reviews = User.find(params[:user_id]).reviews

SELECT "users".* FROM "users"
---
    def new
        if params[:customer_id] && !User.exists?(params[:customer_id])

INSERT INTO "reviews" ("rating", "title", "description", "customer_id", "product_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["rating", 5], ["title", "test"], ["description", "test"], ["customer_id", 1], ["product_id", 1], ["created_at", "2021-10-20 03:38:14.124974"], ["updated_at", "2021-10-20 03:38:14.124974"]]
---
    def create
        @review = Review.new(review_params)
        @review.save