app/controllers/tags_controller.rb

    def create
        @tag = Tag.new(tag_params)
        @tag.save
---
INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Test 2"], ["created_at", "2021-10-23 05:49:10.531982"], ["updated_at", "2021-10-23 05:49:10.531982"]]

    def update
        @tag = Tag.find(params[:id])
---
SELECT  "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]