app/controllers/users_controller.rb

INSERT INTO "users" ("email", "username", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["email", "test@ing.com"], ["username", "testing"], ["password", "test"], ["created_at", "2021-10-15 04:30:51.946880"], ["updated_at", "2021-10-15 04:30:51.946880"]]
---
      def create
        if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 73661865], ["LIMIT", 1]]
UPDATE "users" SET "username" = ?, "password_digest" = ?, "support" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["username", "mwpenn94"], ["password_digest", "$2a$12$IW7j21aMRlsYcssj/w/DDe8sBXcwvabjJmnVKrdkedoqS1BCflCT6"], ["support", 1], ["updated_at", "2021-10-23 06:22:20.084691"], ["id", 73661865]]
---
      def update
        @user = User.find(params[:id])
        @user.update(user_params)