app/views/categories/_form.html.erb

        <br>
        <%= f.input :tag_ids, as: :select, collection: Tag.order(:name), label_method: :name, input_html: {multiple: true} %>
---
SELECT "tags".* FROM "tags" ORDER BY "tags"."name" ASC