app/views/categories/show.html.erb

SELECT "tags".* FROM "tags" INNER JOIN "taggings" ON "tags"."id" = "taggings"."tag_id" WHERE "taggings"."category_id" = ?  [["category_id", 5]]
SELECT "products".* FROM "products" INNER JOIN "taggings" ON "products"."id" = "taggings"."product_id" WHERE "taggings"."tag_id" = ?  [["tag_id", 1]]
---

<% @category.tags.each do |tag| %>
    <div>
        <% tag.products.each do |product| %>

SELECT COUNT(*) FROM "reviews" WHERE "reviews"."product_id" = ?  [["product_id", 1]]
---
            <h3><%= link_to product.name, product_path(product) %></h3>
            <p>Rating: <%= product.average_review_rating %> - <%= product.reviews.count %> reviews </p>