app/views/products/index.html.erb

SELECT COUNT(*) FROM "reviews" WHERE "reviews"."product_id" = ?  [["product_id", 1]]
---
        <h3><%= link_to product.name, product_path(product) %></h3>
        <p>Rating: <%= product.average_review_rating %> - <%= product.reviews.count %> reviews </p>