app/views/products/show.html.erb

<h2><%= @product.name %></h2><p><%= number_to_currency(@product.price) %></p>
<p>Rating: <%= @product.average_review_rating %> - <%= @product.reviews.count %> reviews </p>
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."product_id" = ?  [["product_id", 1]]
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."product_id" = ?  [["product_id", 1]]

<%= link_to "Have a question? Search for answers", new_product_question_path(@product, @question) %>
<% @product.questions.each do |question| %>
---
SELECT "questions".* FROM "questions" WHERE "questions"."product_id" = ?  [["product_id", 1]]

    <%= link_to "Submit an answer", new_question_answer_path(question, @answer) %>
    <% question.answers.each do |answer| %>
---
SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = ?  [["question_id", 6]]

<%= link_to "Write a customer review", new_product_review_path(@product, @review) %>
<% @product.reviews.each do |review| %>
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."product_id" = ?  [["product_id", 1]]


<p><small>Tags: <%= raw @product.tags.map(&:name).map { |t| link_to t, tag_path(t) }.join(', ') %></small></p>
---
SELECT "tags".* FROM "tags" INNER JOIN "taggings" ON "tags"."id" = "taggings"."tag_id" WHERE "taggings"."product_id" = ?  [["product_id", 1]]